Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus provides extensions that among others set these options by default. Such extensions are:
ja_jp: Quarkusには、これらのオプションをデフォルトで設定するエクステンションがあります。 そのようなエクステンションは以下のとおりです：

source: Quarkus provides first class support for using Flyway as will be explained in this guide.
ja_jp: Quarkusでは、このガイドで説明するように、Flywayを使用するためのファーストクラスのサポートを提供しています。

source: Quarkus provides first class support for using Kotlin as will be explained in this guide.
ja_jp: このガイドで説明するように、QuarkusはKotlinを使用するためのファーストクラスのサポートを提供しています。

source: Quarkus provides first class support for using Liquibase MongoDB Extension as will be explained in this guide.
ja_jp: Quarkusは、このガイドで説明されるように、Liquibase MongoDB エクステンションを使用するためのファーストクラスのサポートを提供します。

source: Quarkus provides first class support for using Liquibase as will be explained in this guide.
ja_jp: Quarkusは、このガイドで説明するように、Liquibaseを使用するためのファーストクラスのサポートを提供しています。

source: Quarkus provides following state store implementations:
ja_jp: Quarkusは、以下のステートストアの実装を提供しています:

source: Quarkus provides form based authentication that works in a similar manner to traditional Servlet form based auth. Unlike traditional form authentication, the authenticated user is not stored in an HTTP session, as Quarkus does not provide clustered HTTP session support. Instead the authentication information is stored in an encrypted cookie, which can be read by all members of the cluster (provided they all share the same encryption key).
ja_jp: Quarkusは、従来のサーブレットのフォームベースの認証と同様の方法で動作するフォームベースの認証を提供します。従来のフォーム認証とは異なり、Quarkusはクラスター化されたHTTPセッションをサポートしていないため、認証されたユーザーはHTTPセッションに保存されません。代わりに、認証情報は暗号化されたCookieに保存され、クラスターのすべてのメンバーが読み取ることができます(すべてのメンバーが同じ暗号化キーを共有している場合)。

source: Quarkus provides form based authentication that works in a similar manner to traditional Servlet form based auth. Unlike traditional form authentication, the authenticated user is not stored in an HTTP session, as Quarkus does not provide clustered HTTP session support. Instead, the authentication information is stored in an encrypted cookie, which can be read by all members of the cluster (provided they all share the same encryption key).
ja_jp: Quarkusには、従来のServletのフォームベース認証と同様に動作する、フォームベース認証があります。従来のフォーム認証とは異なり、Quarkusではクラスタ化されたHTTPセッションがサポートされていないため、認証されたユーザーはHTTPセッションに保存されません。代わりに、認証情報は暗号化されたクッキーに保存されます。このクッキーは、クラスタのすべてのメンバーが読み取ることができます（ただし、すべてのメンバーが同じ暗号化キーを共有している場合）。

source: Quarkus provides form-based authentication that works similarly to traditional Servlet form-based auth. Unlike traditional form authentication, the authenticated user is not stored in an HTTP session because Quarkus does not support clustered HTTP sessions. Instead, the authentication information is stored in an encrypted cookie, which can be read by all cluster members who share the same encryption key.
ja_jp: Quarkusは、従来のServletフォームベース認証と同様に動作するフォームベース認証を提供します。 従来のフォーム認証とは異なり、Quarkusはクラスタ化されたHTTPセッションをサポートしていないため、認証されたユーザーはHTTPセッションに保存されません。 代わりに、認証情報は暗号化されたCookieに保存され、同じ暗号化キーを共有するすべてのクラスタメンバーが読み取ることができます。

source: Quarkus provides form-based authentication that works similarly to traditional Servlet form-based authentication. Unlike traditional form authentication, the authenticated user is not stored in an HTTP session because Quarkus does not support clustered HTTP sessions. Instead, the authentication information is stored in an encrypted cookie, which can be read by all cluster members who share the same encryption key.
ja_jp: Quarkus は、従来の Servlet フォームベース認証と同様に動作するフォームベース認証を提供します。 従来のフォーム認証とは異なり、Quarkus はクラスター化された HTTP セッションをサポートしていないため、認証されたユーザーは HTTP セッションに保存されません。 代わりに、認証情報は暗号化された Cookie に保存され、同じ暗号化キーを共有するすべてのクラスターメンバーが読み取ることができます。

source: Quarkus provides integration with https://jbang.dev[jbang] which allows you to write Java scripts/applications requiring no Maven nor Gradle to get running.
ja_jp: Quarkus は Maven も Gradleも必要としない Java のスクリプトおよびアプリケーションを記述することができる https://jbang.dev[jbang] との統合を提供しています。

source: Quarkus provides mTLS authentication so that you can authenticate users based on their X.509 certificates.
ja_jp: QuarkusはmTLS認証を提供しているので、X.509証明書に基づいてユーザーを認証できます。

source: Quarkus provides manual and automatic instrumentation for tracing and manual instrumentation capabilities for metrics.
ja_jp: Quarkus は、トレース用の手動および自動計装と、メトリクスの手動計装機能を提供します。

source: Quarkus provides multiple integration points for influencing the Kubernetes Client provided as a CDI bean.
ja_jp: Quarkusは、CDI Beanとして提供されるKubernetes Clientに影響を与えるための複数の統合ポイントを提供します。

source: Quarkus provides mutual TLS (mTLS) authentication so that you can authenticate users based on their X.509 certificates.
ja_jp: Quarkus には相互 TLS (mTLS) 認証があり、X.509 証明書に基づいてユーザーを認証することができます。

source: Quarkus provides mutual TLS (mTLS) authentication so that you can authenticate users based on their X.509 certificates. For more information, see xref:security-built-in-authentication.adoc#mutual-tls[mutual TLS authentication].
ja_jp: Quarkusは相互TLS（mTLS）認証を提供するので、X.509証明書に基づいてユーザーを認証することができます。詳細については、 link:security-built-in-authentication-support-concept.html#mutual-tls[相互TLS認証] を参照してください。

source: Quarkus provides mutual TLS (mTLS) authentication so that you can authenticate users based on their X.509 certificates. The simplest way to enforce authentication for all your gRPC services is described in the <<tls-with-mutual-auth>> section of this guide. However, the Quarkus Security supports role mapping that you can use to perform even more fine-grained access control.
ja_jp: Quarkus には相互 TLS (mTLS) 認証があり、X.509 証明書に基づいてユーザーを認証できます。 すべての gRPC サービスに認証を適用する最も簡単な方法については、このガイドの <<tls-with-mutual-auth>> セクションを参照してください。 ただし、Quarkus Security はロールマッピングをサポートしており、これを使用することでより詳細なアクセス制御を実行できます。

source: Quarkus provides other ways to serve static files. This is an example made for the guide.
ja_jp: Quarkusは、静的ファイルを提供する他の方法を提供しています。これはガイドのために作られた例です。

source: Quarkus provides property expressions expansion on configuration values. An expression string is a mix of plain strings and expression segments, which are wrapped by the sequence `${ ... }`.
ja_jp: Quarkus は、設定値のプロパティー式拡張を提供します。式文字列は、プレーン文字列と式セグメントの組み合わせであり、シーケンス `${ ... }` でラップされます。

source: Quarkus provides several extensions to create web applications, this document aims to provide directions on which extension to use for different use cases.
ja_jp: Quarkus は Web アプリケーションを作成するためのエクステンションをいくつか提供しており、このドキュメントではさまざまなユースケースでどのエクステンションを使用するかに関して説明することを目的としています。

source: Quarkus provides several health checks for Kafka. These checks are used in combination with the `quarkus-smallrye-health` extension.
ja_jp: Quarkusは、Kafkaのヘルスチェックをいくつか提供しています。これらのチェックは、 `quarkus-smallrye-health` エクステンションと組み合わせて使用します。

source: Quarkus provides support for Apache Kafka through https://smallrye.io/smallrye-reactive-messaging/[SmallRye Reactive Messaging] framework. Based on Eclipse MicroProfile Reactive Messaging specification 2.0, it proposes a flexible programming model bridging CDI and event-driven.
ja_jp: Quarkus は、 https://smallrye.io/smallrye-reactive-messaging/[SmallRye Reactive Messaging] フレームワークを通じて Apache Kafka のサポートを提供します。 Eclipse MicroProfile Reactive Messaging 仕様 2.0 に基づいて、CDI とイベント駆動型を橋渡しする柔軟なプログラミングモデルを提案します。

source: Quarkus provides support for Apache Pulsar through https://smallrye.io/smallrye-reactive-messaging/[SmallRye Reactive Messaging] framework. Based on Eclipse MicroProfile Reactive Messaging specification 3.0, it proposes a flexible programming model bridging CDI and event-driven.
ja_jp: Quarkus は、 https://smallrye.io/smallrye-reactive-messaging/[SmallRye Reactive Messaging] フレームワークを通じて Apache Pulsar のサポートを提供します。 Eclipse MicroProfile Reactive Messaging 仕様 3.0 に基づいて、CDI とイベント駆動型を橋渡しする柔軟なプログラミングモデルを提案します。

source: Quarkus provides support for live reloading changes made to source code. This support is also available to Kotlin, meaning that developers can update their Kotlin source code and immediately see their changes reflected.
ja_jp: Quarkusは、ソースコードに加えられた変更をライブでリロードする機能をサポートしています。このサポートはKotlinでも利用できます。つまり、開発者はKotlinのソースコードを更新して、変更が反映されたことをすぐに確認することができます。

source: Quarkus provides support for properties file based authentication that is intended for development and testing purposes. It is not recommended that this be used in production as at present only plaintext and MD5 hashed passwords are used, and properties files are generally too limited to use in production.
ja_jp: Quarkusでは、開発とテストを目的としたプロパティーファイルベースの認証をサポートしています。現在のところ、平文とMD5ハッシュ化されたパスワードしか使用されておらず、プロパティーファイルは一般的に本番環境で使用するには制限が多すぎるため、本番環境で使用することはお勧めできません。

source: Quarkus provides support for properties file-based authentication intended for development and testing purposes.
ja_jp: Quarkusは、開発およびテストを目的としたプロパティファイルベースの認証をサポートしています。

source: Quarkus provides support for properties file-based authentication intended for development and testing purposes. It is not recommended to use this authentication in production as, at present, only plain-text and MD5 hashed passwords are used, and properties files are generally too limited.
ja_jp: Quarkusでは、開発およびテストを目的としたプロパティファイルベースの認証がサポートされています。現時点では、平文およびMD5ハッシュ化されたパスワードのみが使用され、プロパティファイルは一般に制限が多い為、この認証を本番環境で使用することは推奨されていません。

source: Quarkus provides support for some of the most used features of Spring Security's `@PreAuthorize` annotation. The expressions that are supported are the following:
ja_jp: Quarkus は、Spring Security の `@PreAuthorize` アノテーションで最もよく使用される機能のいくつかをサポートします。サポートされている式は次のとおりです。

source: Quarkus provides support for the Elasticsearch High Level REST Client but keep in mind that it comes with some caveats:
ja_jp: QuarkusはElasticsearch High Level REST Clientのサポートを提供していますが、いくつかの注意点があることを覚えておいてください。

source: Quarkus provides support for using Picocli. This guide contains examples of `picocli` extension usage.
ja_jp: Quarkus では、Picocli を使用するためのサポートを提供しています。このガイドには、 `picocli` エクステンションの使用例が記載されています。

source: Quarkus provides support to store secrets in environment properties. For more information, see the Quarkus xref:config.adoc#secrets-in-environment-properties[store secrets in an environment properties file] guide.
ja_jp: Quarkus は、環境プロパティーにシークレットを保存する機能をサポートしています。 詳細は、Quarkus xref:config.adoc#secrets-in-environment-properties[環境プロパティーファイルへのシークレットの保存] ガイドを参照してください。

source: Quarkus provides the <<building-my-first-extension.adoc#maven-setup,`create-extension` Maven Mojo>> to initialize an extension project.
ja_jp: Quarkusは、エクステンションプロジェクトを初期化するために、 link:building-my-first-extension.html#maven-setup[`create-extension` Maven Mojo] を提供します。

source: Quarkus provides the Dev Services for Keycloak feature, which is enabled by default when the `quarkus-oidc` extension is started in dev mode, the integration tests are running in test mode, and when no `quarkus.oidc.auth-server-url` property is configured. The Dev Services for Keycloak feature starts a Keycloak container for both the dev and test modes. It initializes them by registering the existing Keycloak realm or creating a new realm with the client and users required for you to start developing your Quarkus application secured by Keycloak immediately. The container restarts when the `application.properties` or the realm file changes have been detected.
ja_jp: Quarkus には、Dev Services for Keycloak 機能があります。この機能は、`quarkus-oidc` エクステンションが開発モードで起動され、結合テストがテストモードで実行され、 `quarkus.oidc.auth-server-url` プロパティーが設定されていない場合にデフォルトで有効になります。 Dev Services for Keycloak 機能は、開発モードとテストモードの両方で Keycloak コンテナーを起動します。 Keycloak で保護された Quarkus アプリケーションの開発をすぐに開始するために必要なクライアントとユーザーを含む既存の Keycloak レルムを登録するか、新しいレルムを作成することで、コンテナーを初期化します。 `application.properties` またはレルムファイルの変更が検出されると、コンテナーが再起動します。

source: Quarkus provides the `QuarkusComponentTestExtension`, a JUnit extension to ease the testing of components and mocking of their dependencies. This JUnit extension is available in the `quarkus-junit-component` dependency.
ja_jp: Quarkus は、コンポーネントのテストと依存関係のモック作成を容易にする JUnit エクステンションである `QuarkusComponentTestExtension` を提供します。この JUnit エクステンションは、 `quarkus-junit-component` 依存関係で利用できます。

source: Quarkus provides the `QuarkusComponentTestExtension`, a JUnit extension to ease the testing of components and mocking of their dependencies. This JUnit extension is available in the `quarkus-junit5-component` dependency.
ja_jp: Quarkus は、コンポーネントのテストと依存関係のモック作成を容易にする JUnit エクステンションである `QuarkusComponentTestExtension` を提供します。 この JUnit エクステンションは、 `quarkus-junit5-component` 依存関係で利用できます。

source: Quarkus provides the `quay.io/quarkus/quarkus-distroless-image:1.0` image. It contains the required packages to run a native executable and is only **9Mb**. Just add your application on top of this image, and you will get a tiny container image.
ja_jp: Quarkus は、 `quay.io/quarkus/quarkus-distroless-image:1.0` イメージを提供します。ネイティブ実行可能ファイルを実行するために必要なパッケージが含まれており、サイズはほんの **9Mb** です。このイメージの上にアプリケーションを追加するだけで、小さなコンテナイメージを得ることができます。

source: Quarkus provides the `quay.io/quarkus/quarkus-distroless-image:2.0` image. It contains the required packages to run a native executable and is only **9Mb**. Just add your application on top of this image, and you will get a tiny container image.
ja_jp: Quarkus は、 `quay.io/quarkus/quarkus-distroless-image:2.0` イメージを提供します。ネイティブ実行可能ファイルを実行するために必要なパッケージが含まれており、サイズはほんの **9Mb** です。このイメージの上にアプリケーションを追加するだけで、小さなコンテナーイメージを得られます。

source: Quarkus provides the ability to limit test execution to tests with specific `@TestProfile` annotations. This works by leveraging the `tags` method of `QuarkusTestProfile` in conjunction with the `quarkus.test.profile.tags` system property.
ja_jp: Quarkus は、テストの実行を特定の `@TestProfile` アノテーションを持つテストに制限できます。これは、 `QuarkusTestProfile` の `tags` メソッドを `quarkus.test.profile.tags` システムプロパティーと組み合わせて利用することで機能します。

source: Quarkus provides the following extensions to set up REST Data with Panache. Please, check out the next compatibility table to use the right one according to the technology you are using:
ja_jp: Quarkusは、REST Data with Panacheをセットアップするために、以下のエクステンションを提供しています。次の互換性表を参照して、使用している技術に応じて適切なものを使用してください:

source: Quarkus provides the following extensions to set up REST Data with Panache. Please, check out the next compatibility table to use the right one according to the technology you're using:
ja_jp: Quarkusは、PanacheでREST Dataを設定するために、以下のエクステンションを提供しています。次の互換性テーブルを参照して、使用している技術に応じて適切なものを使用してください:

source: Quarkus provides the foundation for building secure, cloud-native, and AI-infused applications. Quarkus applications integrate with external model runtimes through LangChain4j, which offers rich abstractions for connecting to LLM providers, managing embeddings, defining tools, and orchestrating agentic workflows. This keeps AI where it belongs, as a capability embedded in enterprise applications, while Quarkus ensures performance, scalability, and operational reliability.
ja_jp: Quarkusは、セキュアでクラウドネイティブ、そしてAIが組み込まれたアプリケーションを構築するための基盤を提供します。Quarkusアプリケーションは、LangChain4jを介して外部モデルランタイムと統合されます。LangChain4jは、LLMプロバイダーへの接続、埋め込みの管理、ツールの定義、およびエージェントワークフローのオーケストレーションのための豊富な抽象化を提供します。これにより、AIはエンタープライズアプリケーションに組み込まれた機能として、本来あるべき場所に配置され、同時にQuarkusはパフォーマンス、スケーラビリティ、運用上の信頼性を保証します。

source: Quarkus provides the https://github.com/smallrye/smallrye-open-api/[SmallRye OpenAPI] extension compliant with the https://github.com/eclipse/microprofile-open-api/[MicroProfile OpenAPI] specification in order to generate your API https://spec.openapis.org/oas/v3.1.0.html[OpenAPI v3 specification].
ja_jp: Quarkus では、API の https://spec.openapis.org/oas/v3.1.0.html[OpenAPI v3 仕様] を生成するために、https://github.com/eclipse/microprofile-open-api/[MicroProfile OpenAPI] 仕様に準拠した https://github.com/smallrye/smallrye-open-api/[SmallRye OpenAPI] エクステンションを提供しています。

source: Quarkus provides the https://github.com/smallrye/smallrye-open-api/[Smallrye OpenAPI] extension compliant with the https://github.com/eclipse/microprofile-open-api/[MicroProfile OpenAPI] specification in order to generate your API https://github.com/OAI/OpenAPI-Specification/blob/main/versions/3.0.0.md[OpenAPI v3 specification].
ja_jp: Quarkusでは、APIの link:https://github.com/OAI/OpenAPI-Specification/blob/main/versions/3.0.0.md[OpenAPI v3仕様]を生成するために、 link:https://github.com/eclipse/microprofile-open-api/[MicroProfile OpenAPI]仕様に準拠した link:https://github.com/smallrye/smallrye-open-api/[Smallrye OpenAPI]エクステンションを提供しています。

source: Quarkus provides the xref:building-my-first-extension.adoc#maven-setup[`create-extension` Maven Mojo] to initialize an extension project.
ja_jp: Quarkusは、エクステンションプロジェクトを初期化するために、 xref:building-my-first-extension.adoc#maven-setup[`create-extension` Maven Mojo] を提供しています。

source: Quarkus provides two implementation of the gRPC server: gRPC Java (based on Netty) and Vert.x. Both of them support TLS.
ja_jp: Quarkus は、gRPC サーバーの 2 つの実装である gRPC Java (Netty ベース) と Vert.x を提供します。 どちらも TLS をサポートしています。

source: Quarkus provides two ways of accessing Elasticsearch:
ja_jp: Quarkusは、Elasticsearchにアクセスする2つの方法を提供します:

source: Quarkus provides two ways of accessing Elasticsearch: via the lower level `RestClient` or via the `RestHighLevelClient` we will call them the low level and the high level clients.
ja_jp: QuarkusはElasticsearchにアクセスするための2つの方法を提供しています:低レベルの `RestClient` 経由、または `RestHighLevelClient` 経由であり、低レベルと高レベルのクライアントと呼びます。

source: Quarkus provides various configuration knobs under the `quarkus.spring-cloud-config` root. For the purposes of this guide, our Quarkus application is going to be configured in `application.properties` as follows:
ja_jp: Quarkusは、 `quarkus.spring-cloud-config` ルートで、さまざまな設定ノブを提供します。このガイドでは、Quarkusアプリケーションは、 `application.properties` で次のように設定されます。

source: Quarkus provides very solid tools for creating or integrating Single Page Applications to Quarkus (React, Angular, Vue, …), here are 3 options:
ja_jp: Quarkus は、シングルページアプリケーション (React、Angular、Vue など) を作成または Quarkus に統合するための非常に堅牢なツールを提供します。以下に 3 つのオプションを紹介します。

source: Quarkus redefines how Java applications are built and executed by shifting much of the work to the build phase ensuring that the costly work happens only once — during the build process — not at every startup. It results in faster, smaller, and more resource-efficient Java applications on both GraalVM native images and traditional JVM deployments.
ja_jp: Quarkusは、作業の大部分をビルドフェーズに移行させることで、Javaアプリケーションの構築と実行方法を再定義します。これにより、高コストの作業はビルドプロセス中に一度だけ発生し、起動のたびに繰り返されることはありません。その結果、GraalVMネイティブイメージと従来のJVMデプロイメントの両方で、より高速で、より小さく、よりリソース効率の高いJavaアプリケーションが実現します。

source: Quarkus registers a couple of routes with specific order values. The constants are defined in the `io.quarkus.vertx.http.runtime.RouteConstants` class and listed in the table below. A custom route should define the order of value 20000 or higher so that it does not interfere with the functionality provided by Quarkus and extensions.
ja_jp: Quarkusは、特定のオーダー値を持ついくつかのルートを登録します。 定数は `io.quarkus.vertx.http.runtime.RouteConstants` クラスで定義され、以下の表に記載されています。 カスタムルートは、Quarkusやエクステンションが提供する機能を妨げないように、値20000以上のオーダーを定義する必要があります。

source: Quarkus relies on link:https://github.com/smallrye/smallrye-config/[SmallRye Config] and inherits its features:
ja_jp: Quarkus は link:https://github.com/smallrye/smallrye-config/[SmallRye Config] に依存しており、その機能を継承しています。

source: Quarkus relies on the JBoss Logging library for all the logging requirements.
ja_jp: Quarkusは、すべてのロギング要件をJBoss Loggingライブラリに依存しています。

source: Quarkus represents a fundamental shift in how Java applications are built for modern cloud environments. For Apache Polaris, an Iceberg catalog designed to serve multiple query engines, Quarkus provides the ideal combination of performance, developer productivity, and architectural flexibility.
ja_jp: Quarkus は、最新のクラウド環境向けに Java アプリケーションが構築される方法における根本的な変化を象徴しています。複数のクエリエンジンに対応するように設計された Iceberg カタログである Apache Polaris にとって、Quarkus はパフォーマンス、開発者の生産性、およびアーキテクチャの柔軟性の理想的な組み合わせを提供します。

source: Quarkus requires a recent version of the Maven compiler plugin supporting the annotationProcessorPaths configuration.
ja_jp: Quarkus では、annotationProcessorPaths 設定に対応する、最新バージョンの Maven コンパイラープラグインのが必要です。

source: Quarkus requires these configs to run tests properly.
ja_jp: Quarkusは、テストを適切に実行するためにこれらの設定を必要とします。

source: Quarkus runtime and ecosystem architecture
ja_jp: Quarkusのランタイムとエコシステム・アーキテクチャ

source: Quarkus scheduler and Quartz
ja_jp: QuarkusスケジューラとQuartz

source: Quarkus security offers a Jakarta Persistence integration to collect usernames, passwords, and roles and store them into Jakarta Persistence database entities.
ja_jp: Quarkus Securityは、ユーザー名、パスワード、ロールを収集し、Jakarta Persistenceデータベースエンティティに格納するJakarta Persistence統合機能を提供します。

source: Quarkus security offers a Jakarta Persistence integration to collect usernames, passwords, and roles, and store them into Jakarta Persistence database entities.
ja_jp: Quarkus securityには、ユーザー名、パスワード、ロールを収集し、Jakarta Persistenceデータベースエンティティに保存するためのJakarta Persistence統合があります。

source: Quarkus sets this parameter to the current application request URL by default. For example, if a user is trying to access a Quarkus service endpoint at `http://localhost:8080/service/1`, then the `redirect_uri` parameter is set to `http://localhost:8080/service/1`. Similarly, if the request URL is `http://localhost:8080/service/2`, then the `redirect_uri` parameter is set to `http://localhost:8080/service/2`.
ja_jp: Quarkus は、デフォルトでこのパラメーターを現在のアプリケーションリクエスト URL に設定します。 たとえば、ユーザーが `http://localhost:8080/service/1` にある Quarkus サービスエンドポイントにアクセスしようとしている場合、 `redirect_uri` パラメーターは `http://localhost:8080/service/1` に設定されます。 同様に、リクエスト URL が `http://localhost:8080/service/2` の場合、 `redirect_uri` パラメーターは `http://localhost:8080/service/2` に設定されます。

source: Quarkus ships with a Developer UI, which is available in dev mode (when you start quarkus with `mvn quarkus:dev`) at http://localhost:8080/q/dev-ui[/q/dev-ui] by default. It will show you something like this:
ja_jp: Quarkus には Developer UI が搭載されており、dev モード (`mvn quarkus:dev` で Quarkus を起動) で使用可能で、 デフォルトで http://localhost:8080/q/dev-ui[/q/dev-ui] に存在し、次のような画面が表示されます。

source: Quarkus ships with a new experimental Dev UI, which is available in dev mode (when you start quarkus with `mvn quarkus:dev`) at http://localhost:8080/q/dev-v1[/q/dev-v1] by default. It will show you something like this:
ja_jp: Quarkusには新しい実験的なDev UIが搭載されており、devモード（ `mvn quarkus:dev` ）でQuarkusを起動すると、デフォルトで link:http://localhost:8080/q/dev-v1[/q/dev-v1] に表示されます。このUIは、次のようなものを表示します:

source: Quarkus should automatically discover this implementation and use it instead of the default implementation discussed earlier.
ja_jp: Quarkus は、この実装を自動的に検出し、前述のデフォルトの実装の代わりに使用する必要があります。

source: Quarkus simplifies Jackson configuration via CDI beans. Create a CDI bean of type `io.quarkus.jackson.ObjectMapperCustomizer` to apply various Jackson settings. Here's an example for registering a custom module:
ja_jp: Quarkus は、CDI Bean を介して Jackson の設定を簡素化します。さまざまな Jackson 設定を適用するには、`io.quarkus.jackson.ObjectMapperCustomizer` タイプの CDI Bean を作成します。カスタムモジュールを登録する例を次に示します。

source: Quarkus simplifies database configuration by offering the Dev Services feature, enabling zero-config database setup for testing or running in development (dev) mode. In dev mode, the suggested approach is to use DevServices and let Quarkus handle the database for you, whereas for production mode, you provide explicit database configuration details pointing to a database managed outside of Quarkus.
ja_jp: Quarkusでは、Dev Services機能によってデータベース設定が簡素化され、テストや開発（dev）モードでの実行のためのデータベース設定をゼロコンフィギュレーションで行うことができます。 開発モードでは、DevServicesを使用してQuarkusにデータベースを処理させる方法が推奨されます。一方、本番モードでは、Quarkusの外部で管理されるデータベースを指す明示的なデータベース設定の詳細を記述してください。

source: Quarkus simplifies logging by automatically adding logger fields to classes that use `io.quarkus.logging.Log`. This eliminates the need for repetitive boilerplate code and enhances logging setup convenience.
ja_jp: Quarkus は、 `io.quarkus.logging.Log` を使用するクラスにロガーフィールドを自動的に追加することで、ロギングを簡素化します。 これにより、反復的な定型コードが不要になり、ロギング設定の利便性が向上します。
